In [1]:
import numpy as np 
import pandas as pd

In [2]:
data = np.random.randint(1,10,(3,3))

In [3]:
df = pd.DataFrame(index=["enes","ali","said"],columns=["not1","not2","not3"],data=data)

In [4]:
df["not4"]=[10,20,30]
df

      not1  not2  not3  not4
enes     8     4     7    10
ali      5     6     3    20
said     6     6     4    30

In [5]:
df.drop("not4",axis=1,inplace=True)
df

      not1  not2  not3
enes     8     4     7
ali      5     6     3
said     6     6     4

In [6]:
df.drop("enes")

      not1  not2  not3
ali      5     6     3
said     6     6     4

In [7]:
df.drop("enes",axis=0,inplace=False)

      not1  not2  not3
ali      5     6     3
said     6     6     4

In [8]:
df

      not1  not2  not3
enes     8     4     7
ali      5     6     3
said     6     6     4

In [9]:
df.loc["enes"]

not1    8
not2    4
not3    7
Name: enes, dtype: int64

In [10]:
df.loc["enes"]["not3"]

np.int64(7)

In [11]:
df.loc["enes","not3"]  = 5
df

      not1  not2  not3
enes     8     4     5
ali      5     6     3
said     6     6     4

In [12]:
df["not1"]=[10,9,8]
df

      not1  not2  not3
enes    10     4     5
ali      9     6     3
said     8     6     4

In [13]:
df>5

      not1   not2   not3
enes  True  False  False
ali   True   True  False
said  True   True  False

In [14]:
df[df>5]

      not1  not2  not3
enes    10   NaN   NaN
ali      9   6.0   NaN
said     8   6.0   NaN

In [15]:
df[df["not1"]>8]  # Not1 i 8 den büyük olanların bilgilerini getir

      not1  not2  not3
enes    10     4     5
ali      9     6     3

In [16]:
### DataFrame Index Slicing

In [17]:
dfr = df.reset_index(inplace=False)
dfr

  index  not1  not2  not3
0  enes    10     4     5
1   ali     9     6     3
2  said     8     6     4

In [18]:
#df.loc["enes"]  # We reseted index so that is useless now
dfr.iloc[0 , 0:3]

index    enes
not1       10
not2        4
Name: 0, dtype: object

In [19]:
indexes = ["adambir","adamiki","adamüç"]
dfn = df
dfn["indexes"]=indexes
dfn

      not1  not2  not3  indexes
enes    10     4     5  adambir
ali      9     6     3  adamiki
said     8     6     4   adamüç

In [20]:
dfn.set_index("indexes",inplace=True)

In [21]:
dfn.loc["adambir"]

not1    10
not2     4
not3     5
Name: adambir, dtype: int64

In [24]:
first_index = ["Grup A","Grup A","Grup A","Grup B","Grup B","Grup B"]
second_index = ["Enes","Ali","Sait","Mustafa","Mahmut","Veli"]
zipped_index = list(zip(first_index,second_index))
zipped_index

[('Grup A', 'Enes'),
 ('Grup A', 'Ali'),
 ('Grup A', 'Sait'),
 ('Grup B', 'Mustafa'),
 ('Grup B', 'Mahmut'),
 ('Grup B', 'Veli')]

In [25]:
data = np.ones((6,2))
data

array([[1., 1.],
       [1., 1.],
       [1., 1.],
       [1., 1.],
       [1., 1.],
       [1., 1.]])

In [26]:
zipped_index = pd.MultiIndex.from_tuples(zipped_index)

In [27]:
big_df = pd.DataFrame(index=zipped_index , data = data , columns=["age","salary"])
big_df

                age  salary
Grup A Enes     1.0     1.0
       Ali      1.0     1.0
       Sait     1.0     1.0
Grup B Mustafa  1.0     1.0
       Mahmut   1.0     1.0
       Veli     1.0     1.0

In [28]:
big_df.loc["Grup A"]

      age  salary
Enes  1.0     1.0
Ali   1.0     1.0
Sait  1.0     1.0

In [30]:
big_df.loc["Grup A"].loc["Enes"]

age       1.0
salary    1.0
Name: Enes, dtype: float64